# IsSuitableForModelElements Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SketchPlane..::..IsSuitableForModelElements Property
SketchPlane Class See Also
---
Identifies if the sketch plane can be assigned to model elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsSuitableForModelElements { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSuitableForModelElements As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSuitableForModelElements {
	bool get ();
}
```

# Remarks
Sketch planes with this property set to true are suitable to be used to create model elements. Planes where this property is false will be rejected when used to create model curves, symbolic curves, generic forms, or other sketched elements.
# See Also
SketchPlane Class
Autodesk.Revit.DB Namespace